print("Введите первый цвет ")
c1=input()
print("Введите второй цвет ")
c2=input()
if (c1!="красный" and c1!="синий" and c1!="желтый") or (c2!="красный" and c2!="синий" and c2!="желтый"):
    print("Ошибка")
if (c1=="красный" and c2=="синий") or (c1=="синий" and c2=="красный"):
    print("фиолетовый")
elif (c1 == "красный" and c2 == "желтый") or (c1 == "желтый" and c2 == "красный"):
    print("оранжевый")
elif (c1=="синий" and c2=="желтый") or (c1=="желтый" and c2=="синий"):
    print("зеленый")
